#ifndef _QUOTECLIENT_CLT_DEF_H
#define _QUOTECLIENT_CLT_DEF_H


typedef unsigned __int64	uint64_t;
typedef __int64				int64_t;
typedef unsigned int		uint32_t;
typedef int					int32_t;
typedef unsigned short		uint16_t;
typedef short				int16_t;
typedef unsigned char		uint8_t;
typedef char				int8_t;


#pragma pack(1)
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................

//市场宏定义
enum XDFMarket
{
	XDF_SH =0,						//上证L1
	XDF_SZ =1,						//深证L1
	XDF_CF =9,						//中金期货
	XDF_CNF = 14,					//商品期货(上海/郑州/大连)
	XDF_SHOPT =27,					//上证期权
	XDF_ZJOPT =28,					//中金期权
	
	XDF_SHL2 = 3,					//上证L2(QuoteClientApi内部屏蔽)
	XDF_SZL2 = 16,					//深圳L2(QuoteClientApi内部屏蔽)


	XDF_SZOPT= 31,					//深圳期权

	XDF_CNFOPT = 35,				//商品期货和商品期权(上海/郑州/大连)

};


//状态宏定义
enum XDFRunStat
{
	XRS_None=0,					//不可用
	XRS_Unknow,					//未知
	XRS_Init,					//未就绪

	XRS_Normal=5,				//可用

	//XRS_ForceClose =10,			
};

//数据包Head
typedef struct  
{
	uint8_t					MarketID;		//见XDFMarket定义
	uint32_t				PkgSize;		//数据包的大小
	char					Reserved[59];	//
}XDFAPI_PkgHead;

//消息包Head
typedef struct  
{
	int16_t					MsgType;		//消息类型，[有符号，当符号为负有其他含义，详细见文档]
	uint16_t				MsgLen;			//消息体长度
}XDFAPI_MsgHead;

//组合消息包Head
typedef struct  
{
	int16_t					MsgType;		//复合消息类型，[符号为负]
	uint16_t				MsgLen;			//复合消息体长度(含MsgCount字段在内)
	uint16_t				MsgCount;		//消息的个数
}XDFAPI_UniMsgHead;


//价位
typedef struct
{
	uint32_t				Price;					//委托价格[* 放大倍数]
	uint64_t				Volume;					//委托量[股]
} tagXDFAPI_BuySell;



//[MsgType=1 MsgLen=10] 市场状态
typedef struct
{
	unsigned char					MarketID;				//市场编号
	unsigned long					MarketDate;				//市场日期[YYYYMMDD格式]
	unsigned long					MarketTime;				//市场时间[HHMMSS格式]
	unsigned char					MarketStatus;			//市场状态[0初始化状态 1行情中状态]
}XDFAPI_MarketStatusInfo;


//[MsgType= 100 MsgLen= 3] 市场分类Head
typedef struct
{
	unsigned short					WareCount;				//商品数量[包括指数和个股等所有的商品]
	unsigned char					KindCount;				//类别数量

}XDFAPI_MarketKindHead;

//[MsgType= 101 MsgLen= 14] 具体市场分类
typedef struct  
{
	int								Serial;					//序号
	char							KindName[8];			//类别的名称
	unsigned char					PriceRate;				//该类别中价格放大倍数[10的多少次方]
	unsigned short					LotSize;				//该类别中"手"比率
	unsigned short					WareCount;				//该类商品的数量
}XDFAPI_MarketKindInfo;




//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//{1}	上海期权	//OnRecvData = 推送[上海期权市场状态14，期权快照15]
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//[MsgType=2 MsgLen=158]上海期权代码表
typedef struct
{
	uint8_t					Market;						//XDFMarket取值
	uint8_t					SecKind;					//证券类型[见文档]
	char					Code[8];					//产品ID
	char					Name[20];					//合约简称
	char					ContractID[19];				//合约代码
	char					OptionType;					//欧式美式(E-欧式  A-美式)
	char					CallOrPut;					//认购认沽(C-   P-)
	
	unsigned long			PreClosePx;					//合约昨收(如遇除权除息则为调整后的收盘价格)(精确到厘)//[*放大倍数]
	unsigned long			PreSettlePx;				//合约昨结//[*放大倍数]
	int						LeavesQty;					//未平仓合约数 = 昨持仓 单位是(张)
	
	char					UnderlyingCode[6];			//标的证券代码
	char					UnderlyingName[8];			//标的证券名称
	char					UnderlyingType[3];			//标的证券类型(EBS -ETF, ASH -A股)
	unsigned long 			UnderlyingClosePx;			//标的证券的昨收 //[*放大倍数]
	
	char					PriceLimitType;				//涨跌幅限制类型(N 有涨跌幅)(R 无涨跌幅)
	unsigned long			UpLimit;					//当日期权涨停价格(精确到厘) //[*放大倍数]
	unsigned long			DownLimit;					//当日期权跌停价格(精确到厘) //[*放大倍数]
	int						LotSize;					//一手等于几张合约
	int						ContractUnit;				//合约单位(经过除权除息调整后的合约单位，一定为整数)
	
	unsigned long			XqPrice;					//行权价格(精确到厘) //[*放大倍数] 
	int						StartDate;					//首个交易日(YYYYMMDD)
	int						EndDate;					//最后交易日(YYYYMMDD)
	int						XqDate;						//行权日(YYYYMMDD)
	int						DeliveryDate;				//交割日(YYYYMMDD)
	int						ExpireDate;					//到期日(YYYYMMDD)
	
	char					UpdateVersion;				//期权合约的版本号(新挂合约是'1')
	
	unsigned long			MarginUnit;					//单位保证金(精确到分)//[*放大100]
	short					MarginRatio;				//保证金比例1(%)
	short					MarginRatio2;				//保证金比例2(%)
	
	int						MinMktFloor;				//单笔市价申报下限
	int						MaxMktFloor;				//单笔市价申报上限
	int						MinLmtFloor;				//单笔限价申报下限
	int						MaxLmtFloor;				//单笔限价申报上限
	
	char					StatusFlag[8];				//期权合约状态(8个字符,详细定义见文档)
} XDFAPI_NameTableShOpt;

//[MsgType=14	MsgLen=16]上海期权市场状态
typedef struct
{
	unsigned long					MarketDate;				//市场日期[YYYYMMDD格式]
	unsigned long					MarketTime;				//市场时间[HHMMSS格式]
	char							TradingPhaseCode[8];	//市场状态
}XDFAPI_ShOptMarketStatus;


/**
TradingPhaseCode	期权交易状态，取值范围如下：
该字段为4位字符串，左起每位表示特定的含义，无定义则填空格。
l第1位：‘S’表示启动（开市前）时段，‘C’表示集合竞价时段，‘T’表示连续交易时段，‘B’表示休市时段，‘E’表示闭市时段，‘V’表示波动性中断，‘P’表示临时停牌、‘U’收盘集合竞价。‘M’表示可恢复交易的熔断（盘中集合竞价）,‘N’表示不可恢复交易的熔断（暂停交易至闭市）
l第2位：‘0’表示未连续停牌，‘1’表示连续停牌。（预留，暂填空格）
l第3位：‘0’表示不限制开仓，‘1’表示限制备兑开仓，‘2’表示卖出开仓，‘3’表示限制卖出开仓、备兑开仓，‘4’表示限制买入开仓，‘5’表示限制买入开仓、备兑开仓，‘6’表示限制买入开仓、卖出开仓，‘7’表示限制买入开仓、卖出开仓、备兑开仓
l第4位：‘0’表示此产品在当前时段不接受进行新订单申报，‘1’ 表示此产品在当前时段可接受进行新订单申报。
 */
///[MsgType=15	MsgLen=196]上海期权快照	
typedef struct
{
	char					Code[8];		
	unsigned int			Time;					// 时间(HHMMSSmmm) //如果交易所无精确到毫秒，填0
	unsigned long			PreSettlePx;			// 合约昨结[*放大倍数]
	unsigned long			SettlePrice;			// 今结[*放大倍数], 精确3or4位数
	unsigned long			OpenPx;					// 开盘价[*放大倍数], 精确3or4位数
	unsigned long			HighPx;					// 最高[*放大倍数], 精确3or4位数
	unsigned long			LowPx;					// 最低[*放大倍数], 精确3or4位数
	unsigned long			Now;					// 最新[*放大倍数], 精确3or4位数
	
	unsigned __int64		Volume;					// 成交量(股、张)
	unsigned __int64		Amount;					// 成交金额（元）[放大100倍] 2位小数
	char					TradingPhaseCode[4];	// 交易状态
	
	unsigned long			AuctionPrice;			// 波动性中断参考价[*放大倍数], 精确3位数
	unsigned __int64		AuctionQty;				// 波动性中断集合竞价虚拟匹配量

	unsigned __int64		Position;				// 持仓量
	tagXDFAPI_BuySell		Buy[5];					// 委托买盘
	tagXDFAPI_BuySell		Sell[5];				// 委托卖盘

}XDFAPI_ShOptData;


//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//{2} 中金期权		//OnRecvData = 推送[市场状态MsgType=1 中金期权快照18]
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//[MsgType=3  MsgLen=69]中金期权代码表
typedef struct  
{
	uint8_t					Market;					//XDFMarket取值
	uint8_t					SecKind;				//证券类型[见文档]
	char					Code[32];				//合约代码
	unsigned int			ContractMult;			//合约乘数
	int						ContractUnit;			//合约单位
	int						StartDate;				//首个交易日(YYYYMMDD)
	int						EndDate;				//最后交易日(YYYYMMDD)
	int						XqDate;					//行权日(YYYYMMDD)
	int						DeliveryDate;			//交割日(YYYYMMDD)
	int						ExpireDate;				//到期日(YYYYMMDD)
	unsigned char			ObjectMId;				//标的指数市场编号[参见数据字典-市场编号]，0xFF表示未知
	char					ObjectCode[6];			//标的指数的代码，无标的指数时填空
}XDFAPI_NameTableZjOpt;

//[MsgType=18 MsgLen=228]中金期权快照
typedef struct
{
	unsigned int					DataTimeStamp;			//时间戳(HHMMSSmmm)
    char							Code[32];				//商品代码
    unsigned long					High;                   //最高价格[* 放大倍数]
    unsigned long					Open;                   //开盘价格[* 放大倍数]
    unsigned long					Low;                    //最低价格[* 放大倍数]
    unsigned long					PreClose;               //昨收价格[* 放大倍数]
    unsigned long					PreSettlePrice;         //昨日结算价格[* 放大倍数]
    unsigned long					Now;                    //最新价格[* 放大倍数]
    unsigned long					Close;                  //今日收盘价格[* 放大倍数]
    unsigned long					SettlePrice;            //今日结算价格[* 放大倍数]
    unsigned long					UpperPrice;             //涨停价格[* 放大倍数]
    unsigned long					LowerPrice;             //跌停价格[* 放大倍数]
    double							Amount;                 //总成交金额[元]
    unsigned __int64           		Volume;                 //总成交量[股]
    unsigned __int64            	PreOpenInterest;        //昨日持仓量[股]
    unsigned __int64            	OpenInterest;           //持仓量[股]
    tagXDFAPI_BuySell				Buy[5];                 //委托买盘
    tagXDFAPI_BuySell				Sell[5];                //委托卖盘
}XDFAPI_ZjOptData;

//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//{3} 中金期货		//OnRecvData = 推送[市场状态MsgType=1 中金期货快照20]
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//[MsgType=4  MsgLen=28]中金期货代码表
typedef struct  
{
	uint8_t					Market;					//XDFMarket取值
	uint8_t					SecKind;				//证券类型[见文档]
	unsigned char			ExFlag;					//最后交易日标记,0x01表示是最后交易日只对普通合约有效；其他值暂未定义
    char					Code[6];                //商品代码
    char					Name[8];               	//商品名称
	unsigned long			ContractMult;			//合约乘数
	unsigned char			ObjectMId;				//标的指数市场编号[参见数据字典-市场编号]，0xFF表示未知
	char					ObjectCode[6];			//标的指数的代码，无标的指数时填空
}XDFAPI_NameTableZjqh;

//[MsgType=20 MsgLen=202]中金期货行情快照
typedef struct
{
	unsigned int					DataTimeStamp;			//时间戳(HHMMSSmmm)
    char							Code[6];				//商品代码
    unsigned long					High;                   //最高价格[* 放大倍数]
    unsigned long					Open;                   //开盘价格[* 放大倍数]
    unsigned long					Low;                    //最低价格[* 放大倍数]
    unsigned long					PreClose;               //昨收价格[* 放大倍数]
    unsigned long					PreSettlePrice;         //昨日结算价格[* 放大倍数]
    unsigned long					Now;                    //最新价格[* 放大倍数]
    unsigned long					Close;                  //今日收盘价格[* 放大倍数]
    unsigned long					SettlePrice;            //今日结算价格[* 放大倍数]
    unsigned long					UpperPrice;             //涨停价格[* 放大倍数]
    unsigned long					LowerPrice;             //跌停价格[* 放大倍数]
    double							Amount;                 //总成交金额[元]
    unsigned __int64           		Volume;                 //总成交量[股]
    unsigned __int64            	PreOpenInterest;        //昨日持仓量[股]
    unsigned __int64            	OpenInterest;           //持仓量[股]
    tagXDFAPI_BuySell				Buy[5];                 //委托买盘
    tagXDFAPI_BuySell				Sell[5];                //委托卖盘
}XDFAPI_CffexData;

//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//{4} 上海证券		//OnRecvData = 推送[市场状态MsgType=1 指数快照21 个股快照22][停牌标记变更23]
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//[MsgType=5 MsgLen= 16]上海证券代码表
typedef struct  
{
	uint8_t					Market;					//XDFMarket取值
	uint8_t					SecKind;				//证券类型[见文档]
	char					Code[6];				//商品代码
	char					Name[8];				//商品名称
	//unsigned char			SFlag;					//停牌标记，是否可交易
}XDFAPI_NameTableSh;

//[MsgType=21 MsgLen= 42]指数快照
typedef struct  
{
	char							Code[6];				//商品代码
	unsigned long					High;					//最高指数[* 放大倍数]
	unsigned long					Open;					//开盘指数[* 放大倍数]
	unsigned long					Low;					//最低指数[* 放大倍数]
	unsigned long					PreClose;				//昨收指数[* 放大倍数]
	unsigned long					Now;					//最新指数[* 放大倍数]
	double							Amount;					//总成交金额[元]
	unsigned __int64				Volume;					//总成交量[手]
}XDFAPI_IndexData;

//[MsgType=22 MsgLen= 178]个股快照
typedef struct  
{
	char							Code[6];				//商品代码
	unsigned long					High;					//最高价格[* 放大倍数]
	unsigned long					Open;					//开盘价格[* 放大倍数]
	unsigned long					Low;					//最低价格[* 放大倍数]
	unsigned long					PreClose;				//昨收价格[* 放大倍数]
	unsigned long					Now;					//最新价格[* 放大倍数]
	double							Amount;					//总成交金额[元]
	unsigned __int64				Volume;					//总成交量[股]
	unsigned long					Records;				//成交笔数
	unsigned long					HighLimit;				//涨停价格[* 放大倍数]，注意：上海L1市场源头没有，由源驱动进行计算
	unsigned long					LowLimit;				//跌停价格[* 放大倍数] ，注意：上海L1市场源头没有，由源驱动进行计算
	tagXDFAPI_BuySell				Buy[5];					//买盘
	tagXDFAPI_BuySell				Sell[5];				//卖盘
	unsigned long					Voip;					//基金模拟净值、权证溢价[放大1000倍][ETF、深圳LOF、权证该值有效]
}XDFAPI_StockData5;

//[MsgType=23 MsgLen=7]	停牌标记变更
typedef struct  
{
	char							Code[6];				//商品代码
	unsigned char					SFlag;					//停牌标记，是否可交易，盘中如果发生变化就推送
}XDFAPI_StopFlag;


//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//{5}深圳证券		//OnRecvData = 推送(市场状态1， 指数快照21， 个股快照22， 前缀变更24)(停牌标记变更23)
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................

/**
深圳的证券简称前缀说明						
第五版说明					原第四版内容	
第一位:
	'Y'	整天停牌	'H' 暂停交易	'.' 正常交易（注意是英文小数点字符）
第二位:
	'C' 仅可融资	'S' 仅可融券	'A' 即可融资也可融券	'.' 其他
第三位:
	'I' 当前证券处于发行期间
	'W' 权证：当日可行权/优先股、可转债、分离交易型可转债、企业债、公司债、可交换私募债、证券公司次级债、其他中小企业私募债、资产支持证券：当日可回售/普通股：当日可申报预受要约 
	'V' 当日可网络投票（A、B股分别标识） 
	'.' 通常状态（注意是英文小数点字符）
第四位:
	'A'	上市公司于交易日下午收市前通过指定网站发布公告提示
	'C' 封闭式基金
	'O' 开放式基金
	'F' 非交易型基金
	'L' 上市开放式基金和分级基金子基金
	'E' ETF基金
	'.' 通常状态（注意是英文小数点字符）
*/
//[MsgType=6 MsgLen= 20]深圳证券代码表(带前缀)
typedef struct  
{
	uint8_t					Market;					//XDFMarket取值
	uint8_t					SecKind;				//证券类型[见文档]
	char					Code[6];				//商品代码
	char					Name[8];				//商品名称
	char					PreName[4];				//证券前缀
	//unsigned char			SFlag;					//停牌标记，是否可交易
}XDFAPI_NameTableSz;

//[MsgType=24 MsgLen=10]	前缀标记变更
typedef struct  
{
	char							Code[6];		//商品代码
	unsigned char					PreName[4];		//证券前缀
}XDFAPI_PreNameChg;

//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//{6}三所商品期货		//OnRecvData = 推送(市场状态1， 期货快照26)
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//[MsgType =7 MsgLen= 20]商品期货码表
typedef struct  
{
	uint8_t							Market;					//XDFMarket取值
	uint8_t							SecKind;				//证券类型[见文档]
	char							Code[6];				//商品代码
	char							Name[8];				//商品名称
	unsigned long					LotFactor;				//手比率
}XDFAPI_NameTableCnf;

//[MsgType =26 MsgLen=198]商品期货快照
typedef struct  
{
	unsigned short					Date;					//日期
	unsigned int					DataTimeStamp;			//时间戳(HHMMSSmmm)
	char							Code[6];				//商品代码
    unsigned long					High;                   //最高价格[* 放大倍数]
    unsigned long					Open;                   //开盘价格[* 放大倍数]
    unsigned long					Low;                    //最低价格[* 放大倍数]
    unsigned long					PreClose;               //昨收价格[* 放大倍数]
    unsigned long					PreSettlePrice;         //昨日结算价格[* 放大倍数]
    unsigned long					Now;                    //最新价格[* 放大倍数]
    unsigned long					Close;                  //今日收盘价格[* 放大倍数]
    unsigned long					SettlePrice;            //今日结算价格[* 放大倍数]
    unsigned long					UpperPrice;             //涨停价格[* 放大倍数]
    unsigned long					LowerPrice;             //跌停价格[* 放大倍数]
    double							Amount;                 //总成交金额[元]
    unsigned __int64           		Volume;                 //总成交量[股]
    unsigned __int64            	PreOpenInterest;        //昨日持仓量[股]
    unsigned __int64            	OpenInterest;           //持仓量[股]
    tagXDFAPI_BuySell				Buy[5];                 //委托买盘
    tagXDFAPI_BuySell				Sell[5];                //委托卖盘
}XDFAPI_CNFutureData;


//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//{7}上海L2证券		//OnRecvData = 推送(市场状态1，指数快照21, 上海L2个股快照30)
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//[MsgType=30 MsgLen= 298]个股快照
typedef struct  
{
	char							Code[6];				//商品代码
	unsigned long					High;					//最高价格[* 放大倍数]
	unsigned long					Open;					//开盘价格[* 放大倍数]
	unsigned long					Low;					//最低价格[* 放大倍数]
	unsigned long					PreClose;				//昨收价格[* 放大倍数]
	unsigned long					Now;					//最新价格[* 放大倍数]
	double							Amount;					//总成交金额[元]
	unsigned __int64				Volume;					//总成交量[股]
	unsigned long					Records;				//成交笔数
	unsigned long					HighLimit;				//涨停价格[* 放大倍数]，注意：上海L1市场源头没有，由源驱动进行计算
	unsigned long					LowLimit;				//跌停价格[* 放大倍数] ，注意：上海L1市场源头没有，由源驱动进行计算
	tagXDFAPI_BuySell				Buy[10];				//买盘
	tagXDFAPI_BuySell				Sell[10];				//卖盘
	unsigned long					Voip;					//基金模拟净值、权证溢价[放大1000倍][ETF、深圳LOF、权证该值有效]
}XDFAPI_StockData10;


//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//{8}深圳期权		//OnRecvData = 推送(市场状态1， 35=深圳期权快照)
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//[MsgType=9 MsgLen=114]深圳期权代码表
typedef struct
{
	uint8_t					Market;						//XDFMarket取值
	uint8_t					SecKind;					//类型[见文档]
	char					Code[8];					//产品ID
	char					Name[20];					//合约简称
	char					ContractID[20];				//合约代码
	char					OptionType;					//欧式美式(E-欧式  A-美式)
	char					CallOrPut;					//认购认沽(C-   P-)

	unsigned long			PreClosePx;					//合约昨收(如遇除权除息则为调整后的收盘价格)(精确到厘)//[*放大倍数]
	unsigned long			PreSettlePx;				//合约昨结//[*放大倍数]
	int						LeavesQty;					//未平仓合约数 = 昨持仓 单位是(张)

	char					UnderlyingCode[6];			//标的证券代码
	
	unsigned long			UpLimit;					//当日期权涨停价格(精确到厘) //[*放大倍数]
	unsigned long			DownLimit;					//当日期权跌停价格(精确到厘) //[*放大倍数]
	int						LotSize;					//一手等于几张合约
	int						ContractUnit;				//合约单位(经过除权除息调整后的合约单位，一定为整数)

	unsigned long			XqPrice;					//行权价格(精确到厘) //[*放大倍数] 
	int						StartDate;					//首个交易日(YYYYMMDD)
	int						EndDate;					//最后交易日(YYYYMMDD)
	int						XqDate;						//行权日(YYYYMMDD)
	int						DeliveryDate;				//交割日(YYYYMMDD)
	int						ExpireDate;					//到期日(YYYYMMDD)

	unsigned long			MarginUnit;					//单位保证金(精确到分)//[*放大100]

} XDFAPI_NameTableSzOpt;

/**
TradingPhaseCode	期权交易状态，取值范围如下：
第0位：
S=启动(开市前) O=开盘集合竞价 T=连续竞价 B=休市 C=收盘集合竞价 E=已闭市 H=临时停牌 A=盘后交易 V=波动性中断
第1位：
0=正常交易 1=全天停牌
 */
///[MsgType=35	MsgLen=]深圳期权快照	
typedef struct
{
	char					Code[8];		
	unsigned int			Time;					// 时间(HHMMSSmmm) //如果交易所无精确到毫秒，填0
	unsigned long			PreSettlePx;			// 合约昨结[*放大倍数]
	unsigned long			SettlePrice;			// 今结[*放大倍数], 精确3or4位数
	unsigned long			OpenPx;					// 开盘价[*放大倍数], 精确3or4位数
	unsigned long			HighPx;					// 最高[*放大倍数], 精确3or4位数
	unsigned long			LowPx;					// 最低[*放大倍数], 精确3or4位数
	unsigned long			Now;					// 最新[*放大倍数], 精确3or4位数

	unsigned __int64		Volume;					// 成交量(股、张)
	unsigned __int64		Amount;					// 成交金额（元）[放大100倍] 2位小数
	char					TradingPhaseCode[4];	// 交易状态

	unsigned __int64		Position;				// 持仓量
	tagXDFAPI_BuySell		Buy[5];					// 委托买盘
	tagXDFAPI_BuySell		Sell[5];				// 委托卖盘

}XDFAPI_SzOptData;



//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//{9}深圳L2证券		//OnRecvData = 推送(市场状态1，指数快照21, 深圳L2个股快照30)
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................

















//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//{10}商品期货期权		//OnRecvData = 
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................
//......................................................................................................................................................

//[MsgType =11 MsgLen= ]商品期货与期权码表
typedef struct  
{
	uint8_t							Market;					//XDFMarket取值(XDF_CNFOPT=35)
	uint8_t							SecKind;				//证券类型[见文档]
	char							Code[20];				//商品代码
	char							Name[40];				//商品名称
	unsigned long					LotFactor;				//手比率

	int								LeavesQty;					//未平仓合约数 = 昨持仓 单位是(张)
	unsigned char					ObjectMId;					//上海期货 0  大连期货 1  郑州期货 2 上海期权 3  大连期权 4  郑州期权 5
	char							UnderlyingCode[6];			//标的证券代码
	char							PriceLimitType;				//涨跌幅限制类型(N 有涨跌幅)(R 无涨跌幅)
	unsigned long					UpLimit;					//当日期权涨停价格(精确到厘) //[*放大倍数]
	unsigned long					DownLimit;					//当日期权跌停价格(精确到厘) //[*放大倍数]
	int								LotSize;					//一手等于几张合约
	unsigned long					ContractMult;				//合约乘数
	unsigned long					XqPrice;					//行权价格(精确到厘) //[*放大倍数] 
	int								StartDate;					//首个交易日(YYYYMMDD)
	int								EndDate;					//最后交易日(YYYYMMDD)
	int								XqDate;						//行权日(YYYYMM)
	int								DeliveryDate;				//交割日(YYYYMMDD)
	int								ExpireDate;					//到期日(YYYYMMDD)
	unsigned short					TypePeriodIndx;				//分类交易时段位置
	unsigned char					EarlyNightFlag;				//日/夜盘标识：1.日盘 2.夜盘
}XDFAPI_NameTableCnfOpt;

//[MsgType =34 MsgLen= ]商品期货期权快照
typedef struct  
{
	unsigned short					Date;					//日期
	unsigned int					DataTimeStamp;			//时间戳(HHMMSSmmm)
	char							Code[20];				//商品代码
	unsigned long					High;                   //最高价格[* 放大倍数]
	unsigned long					Open;                   //开盘价格[* 放大倍数]
	unsigned long					Low;                    //最低价格[* 放大倍数]
	unsigned long					PreClose;               //昨收价格[* 放大倍数]
	unsigned long					PreSettlePrice;         //昨日结算价格[* 放大倍数]
	unsigned long					Now;                    //最新价格[* 放大倍数]
	unsigned long					Close;                  //今日收盘价格[* 放大倍数]
	unsigned long					SettlePrice;            //今日结算价格[* 放大倍数]
	unsigned long					UpperPrice;             //涨停价格[* 放大倍数]
	unsigned long					LowerPrice;             //跌停价格[* 放大倍数]
	double							Amount;                 //总成交金额[元]
	unsigned __int64           		Volume;                 //总成交量[股]
	unsigned __int64            	PreOpenInterest;        //昨日持仓量[股]
	unsigned __int64            	OpenInterest;           //持仓量[股]
	tagXDFAPI_BuySell				Buy[5];                 //委托买盘
	tagXDFAPI_BuySell				Sell[5];                //委托卖盘
}XDFAPI_CNFutOptData;








#pragma pack()


#endif


